In [ ]:
import sqlite3

banco = sqlite3.connect('empresa.db')
# Criando um cursor para operar comandos SQL
cursor = banco.cursor()
# Criando uma tabela 'estudantes' com os campos nomeEstudante, idade, email
cursor.execute(
    "CREATE TABLE estudantes(idEstudante integer, nomeEstudante text, idade integer, email text, idDepartamento integer)")
# Inserindo dados na tabela
cursor.execute("INSERT INTO estudantes VALUES(1, 'Maria', 40, 'mariadosanjos@mentorama.com',2)")
banco.commit()
# Consulta dados da tabela 'estudantes'
cursor.execute("SELECT * FROM estudantes")
print(cursor.fetchall())

In [3]:
# Primeiro criamos uma lista com conteúdo a ser inserido, na mesa ordem dos tipos de dados
listaestudantes = [('2', 'Felipe', '18', 'felipe@mentorama.com', '1'),
                   ('3', 'Maria', '45', 'maria@mentorama.com', '4'),
                   ('4', 'João', '33', 'joao@mentorama.com', '4'),
                   ('5', 'Lucia', '17', 'lucia@mentorama.com', '2'),
                   ('6', 'Pedro', '32', 'pedro@mentorama.com', 'NULL'),
                   ('7', 'Izabela', '23', 'izabela@mentorama.com', '3'),
                   ('8', 'Eduardo', '59', 'eduardo@mentorama.com', '4'),
                   ('9', 'Tiago', '38', 'tiago@mentorama.com', '5'),
                   ('10', 'Ana', '25', 'ana@mentorama.com', 'NULL'),
                   ('11', 'Carol', '36', 'carol@mentorama.com', '2'),
                   ('12', 'Leonardo', '28', 'leonardo@mentorama.com', '3'),
                   ('13', 'Vanessa', '45', 'vanessa@mentorama.com', '4'),
                   ('14', 'João', '43', 'joaopedro@mentorama.com', '5'),
                   ('15', 'Mari', '25', 'mari@mentorama.com', '6')]
# Inserimos os dados da Lista dentroi da tabela
cursor.executemany("""INSERT INTO estudantes VALUES (?,?,?,?,?)""", listaestudantes)
print("Dados inseridos com sucesso")
banco.commit()

Dados inseridos com sucesso

In [4]:
# Conculta dados da tabela 'estudantes'
cursor.execute("SELECT * FROM estudantes")
print(cursor.fetchall())
print('Dados inseridos com sucesso')

[(1, 'Maria', 40, 'mariadosanjos@mentorama.com', 2), (2, 'Felipe', 18, 'felipe@mentorama.com', 1), (3, 'Maria', 45, 'maria@mentorama.com', 4), (4, 'João', 33, 'joao@mentorama.com', 4), (5, 'Lucia', 17, 'lucia@mentorama.com', 2), (6, 'Pedro', 32, 'pedro@mentorama.com', 'NULL'), (7, 'Izabela', 23, 'izabela@mentorama.com', 3), (8, 'Eduardo', 59, 'eduardo@mentorama.com', 4), (9, 'Tiago', 38, 'tiago@mentorama.com', 5), (10, 'Ana', 25, 'ana@mentorama.com', 'NULL'), (11, 'Carol', 36, 'carol@mentorama.com', 2), (12, 'Leonardo', 28, 'leonardo@mentorama.com', 3), (13, 'Vanessa', 45, 'vanessa@mentorama.com', 4), (14, 'João', 43, 'joaopedro@mentorama.com', 5), (15, 'Mari', 25, 'mari@mentorama.com', 6), (2, 'Felipe', 18, 'felipe@mentorama.com', 1), (3, 'Maria', 45, 'maria@mentorama.com', 4), (4, 'João', 33, 'joao@mentorama.com', 4), (5, 'Lucia', 17, 'lucia@mentorama.com', 2), (6, 'Pedro', 32, 'pedro@mentorama.com', 'NULL'), (7, 'Izabela', 23, 'izabela@mentorama.com', 3), (8, 'Eduardo', 59, 'eduardo@mentorama.com', 4), (9, 'Tiago', 38, 'tiago@mentorama.com', 5), (10, 'Ana', 25, 'ana@mentorama.com', 'NULL'), (11, 'Carol', 36, 'carol@mentorama.com', 2), (12, 'Leonardo', 28, 'leonardo@mentorama.com', 3), (13, 'Vanessa', 45, 'vanessa@mentorama.com', 4), (14, 'João', 43, 'joaopedro@mentorama.com', 5), (15, 'Mari', 25, 'mari@mentorama.com', 6)]
Dados inseridos com sucesso


INNER JOIN
Figura (5) caderno

In [5]:
# Criando uma tabela 'departamentos' com os campos idDepartamento, nomeDepartamento
cursor.execute("CREATE TABLE departamentos (idDepartamento integer PRIMARY KEY, nomeDepartamento text )")
print('Tabela criada com sucesso!')
# Inserindo dados na tabela
# Primeiro criamos uma lista com conteúdo a ser inserido, na mesma ordem dos tipos de dados definidos
listadepartamento = [('1', 'TI'),
                     ('2', 'Fisica'),
                     ('3', 'Matemática'),
                     ('4', 'Engenharia'),
                     ('5', 'Biologia'),
                     ('6', 'História')]
# Inserimos os dados da lista dentro da tabela
cursor.executemany("""INSERT INTO departamentos VALUES (?, ?)""", listadepartamento)
print('Dados inserido com sucesso')
banco.commit()

Tabela criada com sucesso!
Dados inserido com sucesso

In [ ]:
# Deleta tabela departamentos caso necessario
# cursor.execute("SELECT * FROM departamentos")
# print(cursor.fetchall())

In [6]:
# Conculta dados da tabela 'departamentos'
cursor.execute("SELECT * FROM departamentos")
print(cursor.fetchall())

[(1, 'TI'), (2, 'Fisica'), (3, 'Matemática'), (4, 'Engenharia'), (5, 'Biologia'), (6, 'História')]

VER FIGURA (6) CADERNO

In [7]:
sql = """SELECT estudantes.nomeEstudante, departamentos.nomeDepartamento FROM departamentos
INNER JOIN estudantes ON estudantes.idDepartamento = departamentos.idDepartamento"""
cursor.execute(sql)
print(cursor.fetchall())

[('Maria', 'Fisica'), ('Felipe', 'TI'), ('Maria', 'Engenharia'), ('João', 'Engenharia'), ('Lucia', 'Fisica'), ('Izabela', 'Matemática'), ('Eduardo', 'Engenharia'), ('Tiago', 'Biologia'), ('Carol', 'Fisica'), ('Leonardo', 'Matemática'), ('Vanessa', 'Engenharia'), ('João', 'Biologia'), ('Mari', 'História'), ('Felipe', 'TI'), ('Maria', 'Engenharia'), ('João', 'Engenharia'), ('Lucia', 'Fisica'), ('Izabela', 'Matemática'), ('Eduardo', 'Engenharia'), ('Tiago', 'Biologia'), ('Carol', 'Fisica'), ('Leonardo', 'Matemática'), ('Vanessa', 'Engenharia'), ('João', 'Biologia'), ('Mari', 'História')]

LEFT JOIN
FIGURA (7) CADERNO

In [8]:
# Estudantes é a tabela da esquerda
# Repare a quantidade de registros gerada pela consulta
sql = """SELECT estudantes.nomeEstudante, departamentos.nomeDepartamento FROM estudantes
LEFT JOIN departamentos ON estudantes.idDepartamento = departamentos.idDepartamento"""
cursor.execute(sql)
print(cursor.fetchall())

[('Maria', 'Fisica'), ('Felipe', 'TI'), ('Maria', 'Engenharia'), ('João', 'Engenharia'), ('Lucia', 'Fisica'), ('Pedro', None), ('Izabela', 'Matemática'), ('Eduardo', 'Engenharia'), ('Tiago', 'Biologia'), ('Ana', None), ('Carol', 'Fisica'), ('Leonardo', 'Matemática'), ('Vanessa', 'Engenharia'), ('João', 'Biologia'), ('Mari', 'História'), ('Felipe', 'TI'), ('Maria', 'Engenharia'), ('João', 'Engenharia'), ('Lucia', 'Fisica'), ('Pedro', None), ('Izabela', 'Matemática'), ('Eduardo', 'Engenharia'), ('Tiago', 'Biologia'), ('Ana', None), ('Carol', 'Fisica'), ('Leonardo', 'Matemática'), ('Vanessa', 'Engenharia'), ('João', 'Biologia'), ('Mari', 'História')]

CROSS JOIN
FIGURA (8) CADERNO
Pega Todas combinações

In [9]:
sql = """SELECT estudantes.nomeEstudante, departamentos.nomeDepartamento FROM estudantes
CROSS JOIN departamentos"""
cursor.execute(sql)
print(cursor.fetchall())

[('Maria', 'TI'), ('Maria', 'Fisica'), ('Maria', 'Matemática'), ('Maria', 'Engenharia'), ('Maria', 'Biologia'), ('Maria', 'História'), ('Felipe', 'TI'), ('Felipe', 'Fisica'), ('Felipe', 'Matemática'), ('Felipe', 'Engenharia'), ('Felipe', 'Biologia'), ('Felipe', 'História'), ('Maria', 'TI'), ('Maria', 'Fisica'), ('Maria', 'Matemática'), ('Maria', 'Engenharia'), ('Maria', 'Biologia'), ('Maria', 'História'), ('João', 'TI'), ('João', 'Fisica'), ('João', 'Matemática'), ('João', 'Engenharia'), ('João', 'Biologia'), ('João', 'História'), ('Lucia', 'TI'), ('Lucia', 'Fisica'), ('Lucia', 'Matemática'), ('Lucia', 'Engenharia'), ('Lucia', 'Biologia'), ('Lucia', 'História'), ('Pedro', 'TI'), ('Pedro', 'Fisica'), ('Pedro', 'Matemática'), ('Pedro', 'Engenharia'), ('Pedro', 'Biologia'), ('Pedro', 'História'), ('Izabela', 'TI'), ('Izabela', 'Fisica'), ('Izabela', 'Matemática'), ('Izabela', 'Engenharia'), ('Izabela', 'Biologia'), ('Izabela', 'História'), ('Eduardo', 'TI'), ('Eduardo', 'Fisica'), ('Eduardo', 'Matemática'), ('Eduardo', 'Engenharia'), ('Eduardo', 'Biologia'), ('Eduardo', 'História'), ('Tiago', 'TI'), ('Tiago', 'Fisica'), ('Tiago', 'Matemática'), ('Tiago', 'Engenharia'), ('Tiago', 'Biologia'), ('Tiago', 'História'), ('Ana', 'TI'), ('Ana', 'Fisica'), ('Ana', 'Matemática'), ('Ana', 'Engenharia'), ('Ana', 'Biologia'), ('Ana', 'História'), ('Carol', 'TI'), ('Carol', 'Fisica'), ('Carol', 'Matemática'), ('Carol', 'Engenharia'), ('Carol', 'Biologia'), ('Carol', 'História'), ('Leonardo', 'TI'), ('Leonardo', 'Fisica'), ('Leonardo', 'Matemática'), ('Leonardo', 'Engenharia'), ('Leonardo', 'Biologia'), ('Leonardo', 'História'), ('Vanessa', 'TI'), ('Vanessa', 'Fisica'), ('Vanessa', 'Matemática'), ('Vanessa', 'Engenharia'), ('Vanessa', 'Biologia'), ('Vanessa', 'História'), ('João', 'TI'), ('João', 'Fisica'), ('João', 'Matemática'), ('João', 'Engenharia'), ('João', 'Biologia'), ('João', 'História'), ('Mari', 'TI'), ('Mari', 'Fisica'), ('Mari', 'Matemática'), ('Mari', 'Engenharia'), ('Mari', 'Biologia'), ('Mari', 'História'), ('Felipe', 'TI'), ('Felipe', 'Fisica'), ('Felipe', 'Matemática'), ('Felipe', 'Engenharia'), ('Felipe', 'Biologia'), ('Felipe', 'História'), ('Maria', 'TI'), ('Maria', 'Fisica'), ('Maria', 'Matemática'), ('Maria', 'Engenharia'), ('Maria', 'Biologia'), ('Maria', 'História'), ('João', 'TI'), ('João', 'Fisica'), ('João', 'Matemática'), ('João', 'Engenharia'), ('João', 'Biologia'), ('João', 'História'), ('Lucia', 'TI'), ('Lucia', 'Fisica'), ('Lucia', 'Matemática'), ('Lucia', 'Engenharia'), ('Lucia', 'Biologia'), ('Lucia', 'História'), ('Pedro', 'TI'), ('Pedro', 'Fisica'), ('Pedro', 'Matemática'), ('Pedro', 'Engenharia'), ('Pedro', 'Biologia'), ('Pedro', 'História'), ('Izabela', 'TI'), ('Izabela', 'Fisica'), ('Izabela', 'Matemática'), ('Izabela', 'Engenharia'), ('Izabela', 'Biologia'), ('Izabela', 'História'), ('Eduardo', 'TI'), ('Eduardo', 'Fisica'), ('Eduardo', 'Matemática'), ('Eduardo', 'Engenharia'), ('Eduardo', 'Biologia'), ('Eduardo', 'História'), ('Tiago', 'TI'), ('Tiago', 'Fisica'), ('Tiago', 'Matemática'), ('Tiago', 'Engenharia'), ('Tiago', 'Biologia'), ('Tiago', 'História'), ('Ana', 'TI'), ('Ana', 'Fisica'), ('Ana', 'Matemática'), ('Ana', 'Engenharia'), ('Ana', 'Biologia'), ('Ana', 'História'), ('Carol', 'TI'), ('Carol', 'Fisica'), ('Carol', 'Matemática'), ('Carol', 'Engenharia'), ('Carol', 'Biologia'), ('Carol', 'História'), ('Leonardo', 'TI'), ('Leonardo', 'Fisica'), ('Leonardo', 'Matemática'), ('Leonardo', 'Engenharia'), ('Leonardo', 'Biologia'), ('Leonardo', 'História'), ('Vanessa', 'TI'), ('Vanessa', 'Fisica'), ('Vanessa', 'Matemática'), ('Vanessa', 'Engenharia'), ('Vanessa', 'Biologia'), ('Vanessa', 'História'), ('João', 'TI'), ('João', 'Fisica'), ('João', 'Matemática'), ('João', 'Engenharia'), ('João', 'Biologia'), ('João', 'História'), ('Mari', 'TI'), ('Mari', 'Fisica'), ('Mari', 'Matemática'), ('Mari', 'Engenharia'), ('Mari', 'Biologia'), ('Mari', 'História')]